In [1]:
import pymysql
import pandas as pd

In [2]:
_db = pymysql.connect(
    user = 'root',
    password = '0789',
    host = 'localhost',
    db = 'ubion',
    #charset = 'utf8'
)   # 클래스 안에 값 입력

In [3]:
cursor = _db.cursor(pymysql.cursors.DictCursor)  #생성된 클래스에 메소드입력

In [4]:
sql = "select*from user_info"

cursor.execute(sql)
result = cursor.fetchall()
print(result)

[{'ID': 'test', 'password': '1234', 'name': '고길동', 'phone': '01012345678', 'ads': '서울시 강북구 쌍문동', 'gender': 1, 'age': 45, 'regit_date': '20220310'}, {'ID': 'test2', 'password': '5678', 'name': '둘리', 'phone': '01098765432', 'ads': '북극 어딘가', 'gender': 1, 'age': 10, 'regit_date': '20220310'}, {'ID': 'test3', 'password': '8513', 'name': '마이콜', 'phone': '01045678765', 'ads': '고길동 옆 집', 'gender': 1, 'age': 28, 'regit_date': '20220310'}, {'ID': 'test4', 'password': '9809', 'name': '또치', 'phone': '01029384756', 'ads': '동물원', 'gender': 2, 'age': 4, 'regit_date': '20220310'}, {'ID': 'test5', 'password': '9999', 'name': '도우너', 'phone': '01087653456', 'ads': '깐따삐아', 'gender': 1, 'age': 10, 'regit_date': '20220310'}, {'ID': 'test6', 'password': '4567', 'name': '희동이', 'phone': '01088765543', 'ads': '고길동집', 'gender': 1, 'age': 3, 'regit_date': '20220311'}, {'ID': 'test7', 'password': '0210', 'name': '이선영', 'phone': '01082825555', 'ads': '수원시', 'gender': 2, 'age': 25, 'regit_date': '20220311'}]

In [5]:
# result를 데이터프레임으로 만들기

dt = pd.DataFrame(result)
dt

      ID password name        phone          ads  gender  age regit_date
0   test     1234  고길동  01012345678  서울시 강북구 쌍문동       1   45   20220310
1  test2     5678   둘리  01098765432       북극 어딘가       1   10   20220310
2  test3     8513  마이콜  01045678765      고길동 옆 집       1   28   20220310
3  test4     9809   또치  01029384756          동물원       2    4   20220310
4  test5     9999  도우너  01087653456         깐따삐아       1   10   20220310
5  test6     4567  희동이  01088765543         고길동집       1    3   20220311
6  test7     0210  이선영  01082825555          수원시       2   25   20220311

In [ ]:
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s)"  # sql은 그냥 다 s로 
values = ["test4","9809","또치","01029384756","동물원", 2, 4, "20220310"]

cursor.execute(sql, values)
_db.commit()

In [20]:
sql = "insert into user_info values (%s, %s, %s, %s, %s, %s, %s, %s)"

_ID = input("ID:")
pw = input("password:")
name = input("name:")
phone = input("phone:")
ads = input("ads:")
gender = input("gender:") #정수형으로 안바꿔도 됨
age = input("age:")
regit_date = input("regit_date:")

input_list=[_ID, pw, name, phone, ads, gender, age, regit_date]

cursor.execute(sql, input_list)
_db.commit()

In [11]:
sql_2 = "select*from ads_info"

cursor.execute(sql_2)
result_2 = cursor.fetchall()
print(result_2)

[{'ads': '동물원', 'register_count': 3, 'dol': 50, 'contract_type': 1}, {'ads': '북극 어딘가', 'register_count': 2, 'dol': 1200, 'contract_type': 0}, {'ads': '서울시 강북구 쌍문동', 'register_count': 5, 'dol': 48, 'contract_type': 0}, {'ads': '수원시', 'register_count': 3, 'dol': 50, 'contract_type': 2}, {'ads': '유비온', 'register_count': 20, 'dol': 60, 'contract_type': 2}]

In [12]:
dt_2 = pd.DataFrame(result_2)
dt_2

           ads  register_count   dol  contract_type
0          동물원               3    50              1
1       북극 어딘가               2  1200              0
2  서울시 강북구 쌍문동               5    48              0
3          수원시               3    50              2
4          유비온              20    60              2

In [9]:
sql_2 = "insert into ads_info values(%s,%s,%s,%s)"
values_2 = ["수원시",3,50,2]

cursor.execute(sql_2,values_2)
_db.commit()

In [13]:
sql_join = "SELECT user_info.ID, user_info.name, user_info.ads, ads_info.register_count, ads_info.contract_type from user_info left join ads_info on user_info.ads=ads_info.ads"

cursor.execute(sql_join)
result_3=cursor.fetchall()

dt_3 = pd.DataFrame(result_3)
dt_3

      ID name          ads  register_count  contract_type
0   test  고길동  서울시 강북구 쌍문동             5.0            0.0
1  test2   둘리       북극 어딘가             2.0            0.0
2  test3  마이콜      고길동 옆 집             NaN            NaN
3  test4   또치          동물원             3.0            1.0
4  test5  도우너         깐따삐아             NaN            NaN
5  test6  희동이         고길동집             NaN            NaN
6  test7  이선영          수원시             3.0            2.0

In [14]:
_db.commit()
_db.close()